import React from "react";
import "./Experience.css";

export const Experience = () => {
  return (
    <div className="Experience" id="block4">
      <div className="Experience_title">
        <h3>Опыт работы</h3>
      </div>
      <div className="Experience_info_block">
        <div className="Experience_info">
          <div className="Experience_info_item">
            <h4>Февраль 2023 - по настоящий день</h4>
            <h2>
              Full-stack developer <span>- ТОО "T.A.Dara"</span>
            </h2>
            <p>
              Разработка CRM (Customer Relationship Management) системы для
              торговых операций - это комплексный процесс, направленный на
              создание специализированной платформы, которая помогает
              организациям эффективно управлять и оптимизировать взаимодействие
              с клиентами, а также автоматизировать и улучшать процессы,
              связанные с продажами и обслуживанием клиентов.
            </p>
          </div>
          <div className="Experience_info_item">
            <h4>Апрель 2022 - по настоящий день</h4>
            <h2>
              Преподаватель по веб-разработке <span>- Attractor School</span>
            </h2>
            <p>
              Преподавание курсов по веб-разработке, охватывая широкий спектр
              технологий и навыков. Подготовка и проведение лекций, практических
              занятий и лабораторных работ. Разработка учебных материалов и
              учебных планов для курсов. Помощь студентам в усвоении HTML, CSS,
              JavaScript, TypeScript, React, Node.js и других технологий. Оценка
              студенческих работ и предоставление обратной связи для улучшения
              их навыков. Организация контрольных работ и подготовка студентов к
              экзаменам. Стремление к обеспечению актуальности учебного
              материала и следование современным технологическим трендам.
            </p>
          </div>
        </div>
        <div className="Experience_info">
          <div className="Experience_info_item">
            <h4>Июнь 2021 - Апрель 2022</h4>
            <h2>
              Преподаватель по ресторанному делу <span>- КИТИГ</span>
            </h2>
            <p>
              Преподавание курсов по ресторанному менеджменту, сервису и
              кулинарии. Разработка образовательных программ, учебных материалов
              и оценочных методик. Направление студентов в профессиональной
              стажировке и внеучебных мероприятиях. Организация и проведение
              практических занятий по ресторанному сервису и кулинарии.
              Наблюдение за студентами во время выполнения заданий и коррекция
              производительности. Поддержка в стажировке и обучение на рабочем
              месте. Проведение семинаров и мастер-классов для студентов и
              профессиональных работников в сфере ресторанного бизнеса.
              Содействие в развитии навыков обслуживания, организации и
              управления рестораном.
            </p>
          </div>
          <div className="Experience_info_item">
            <h4>Март 2019 - Май 2021</h4>
            <h2>
              Бармен/Сомелье <span>- Бары и рестораны города Алматы</span>
            </h2>
            <p>
              Создание и предоставление высококачественных коктейлей, а также
              рекомендация вин для удовлетворения потребностей клиентов.
              Эффективное управление барной станцией, включая инвентаризацию,
              заказ сырья и поддержание чистоты и порядка на рабочем месте.
              Проведение обучающих мастер-классов и дегустаций вин для клиентов,
              повышение уровня их знаний о винах и напитках. Забота о высоком
              уровне обслуживания клиентов, включая консультации по выбору
              напитков, учет индивидуальных предпочтений и поддержание приятной
              атмосферы в заведении. Участие в составлении винной карты и
              разработке новых коктейлей, что способствовало повышению доходов
              на 15% и увеличению клиентской базы.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};
